import {Component, OnInit} from '@angular/core';

@Component({
  selector: 'app-covers',
  templateUrl: './covers.component.html',
  styleUrls: ['./covers.component.scss']
})
export class CoversComponent implements OnInit {
  bgTextData: string[] = [
    '優しさも仕草も何もかも嘘でも',
    '思うように信じたものを選ぼう',
    '戸惑いだって有るよ',
    'それでも教えてよ',
    'この雨の解答を見せて',
    'たった一つの大切な物が',
    '最初から分かったら良いのにと',
    '嵌めては崩してを繰り返して',
    'やっと気づいたんだ',
    '想いは決まっていたんだ',
    '騙されたって良いよ',
    '奪われたって良いよ',
    'この傷もこの涙も',
    'この気持ちは全部私のものだ',
    '少ない脳で答えを知った',
    '仕掛けられた罠に揺れ動いた戸惑いも繰り返し',
    '恋をしてみよう',
    '君の優しさの全てが嬉しかったんだ',
    '後悔や痛みの夜を何度明かして',
    '当たり前に成ったのは君のこと',
    '罠だらけの日々を歩けない私の',
    '手を引いて歩く横顔',
    'ぶつかり合って重ならないパズルの',
    '最後のピースをやっと見つけた',
    '心が割れたって何度裏切ったって',
    '君もずっと私を待っていたんだ',
    'すれ違う心の奥底で',
    'ずっと探してた優しさは',
    '温りは何もかも全部君のものだ',
    '少ない脳全部でわかった',
    '仕掛けられた罠を振りほどいたその先に',
    '呆れ顔の君が待っていた',
    '汚れなんて血と混ぜてしまおう',
    '弱さなんてもう忘れてしまおう',
    'うまくいかなくても君と居れる',
    'それ以上なんて有る訳無くて',
    '少ない脳全部で気づいた',
    '熱いキスで何もかも混ぜよう',
    'この先も君のこと守りたいんだ',
    '君の言葉も戸惑いも嬉しかったんだ'
  ];

  constructor() {
  }

  ngOnInit() {
  }

}
