import {Component, OnInit} from '@angular/core';

@Component({
  selector: 'app-illusts',
  templateUrl: './illusts.component.html',
  styleUrls: ['./illusts.component.scss']
})
export class IllustsComponent implements OnInit {
  bgTextData: string[] = [
    '遠い目をした街灯が今更責めたててくる',
    '夜行バスはあと五分',
    'ざわついた灯りが揺れている',
    '嫌気がさした母に連れられ',
    '二人で浴びた朝日は今も覚えている',
    '角を曲がれば雨が降っていて',
    '通りに出れば人が鳴いていて',
    '野良猫が泣いて',
    '爪を噛んでいる放浪少女が抱きかかえている',
    'そんな情景も風化していく',
    '過疎化した夕焼けが',
    '過ぎ去って夜の街になり',
    '夜に溺れたがる僕たちは',
    '廃ビルの屋上で黄昏れる',
    '遠慮気味の太陽が',
    '何もかも綺麗に焼き払う',
    'そんな街に僕はいた',
    'この街で生きていた',
    '五分も歩けば田舎になって',
    '蛙がいつも待っている',
    'その先の僕の家は今では',
    'ここからはもう見えない',
    'ハエがまとわりついて',
    '駄菓子屋はいつか潰れて',
    '昔通りに生きていけると',
    '思っていたら大違いだ',
    'ラブホ街を抜けた先で',
    '姉の迎えを待っている',
    'そんな街に僕はいた',
    'この街で生きていた',
    'この街に僕はいた'
  ];

  constructor() {
  }

  ngOnInit() {
  }

}
